Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0128MCA048.PIC
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="CLCINCR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="CLCINCR" edc:nzwidth="0x20" edc:por="----------------------------0000" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="51" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F80157C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CLCINCR" edc:desc="" edc:mask="0xf" edc:name="CLCINCR" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="CLCINDR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="CLCINDR" edc:nzwidth="0x20" edc:por="----------------------------0000" edc:_modsrc="DOS-01423_RPINRx.Module" edc:_refcount="52" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F801580">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CLCINDR" edc:desc="" edc:mask="0xf" edc:name="CLCINDR" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x7C" edc:_addr="0x1F801584"/>
      <edc:SFRDef edc:access="---------------------------nnnnn" edc:cname="RPA0R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPA0R" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F801600">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPA0R" edc:desc="" edc:mask="0x1f" edc:name="RPA0R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---------------------------nnnnn" edc:cname="RPA1R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPA1R" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F801604">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPA1R" edc:desc="" edc:mask="0x1f" edc:name="RPA1R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---------------------------nnnnn" edc:cname="RPA2R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPA2R" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F801608">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPA2R" edc:desc="" edc:mask="0x1f" edc:name="RPA2R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---------------------------nnnnn" edc:cname="RPA3R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPA3R" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F80160C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPA3R" edc:desc="" edc:mask="0x1f" edc:name="RPA3R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---------------------------nnnnn" edc:cname="RPA4R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPA4R" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F801610">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPA4R" edc:desc="" edc:mask="0x1f" edc:name="RPA4R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x08" edc:_addr="0x1F801614"/>
      <edc:SFRDef edc:access="---------------------------nnnnn" edc:cname="RPA7R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPA7R" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F80161C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPA7R" edc:desc="" edc:mask="0x1f" edc:name="RPA7R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---------------------------nnnnn" edc:cname="RPA8R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPA8R" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="7" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F801620">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPA8R" edc:desc="" edc:mask="0x1f" edc:name="RPA8R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x08" edc:_addr="0x1F801624"/>
      <edc:SFRDef edc:access="---------------------------nnnnn" edc:cname="RPA11R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="RPA11R" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:_modsrc="DOS-02481_RPORx.Module" edc:_refcount="8" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x1F80162C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPA11R" edc:desc="" edc:mask="0x1f" edc:name="RPA11R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="27"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
