Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0128MCA048.PIC
      <edc:SFRDef edc:access="nn-n----------------nnnnn-------" edc:cname="IFS2" edc:desc="" edc:impl="0xd0000f80" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0u-0----------------00000-------" edc:name="IFS2" edc:nzwidth="32" edc:por="0x-0----------------00000-------" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACP_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810060">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="7"/>
            <edc:SFRFieldDef edc:cname="CTMUIF" edc:desc="" edc:mask="0x1" edc:name="CTMUIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA0IF" edc:desc="" edc:mask="0x1" edc:name="DMA0IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA1IF" edc:desc="" edc:mask="0x1" edc:name="DMA1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA2IF" edc:desc="" edc:mask="0x1" edc:name="DMA2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA3IF" edc:desc="" edc:mask="0x1" edc:name="DMA3IF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="16"/>
            <edc:SFRFieldDef edc:cname="AD1IF" edc:desc="" edc:mask="0x1" edc:name="AD1IF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="AD1DC1IF" edc:mask="0x1" edc:name="AD1DC1IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AD1DC2IF" edc:desc="" edc:mask="0x1" edc:name="AD1DC2IF" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----nnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IFS3" edc:desc="" edc:impl="0xfffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----000000000000000u0000u0000000" edc:name="IFS3" edc:nzwidth="32" edc:por="----000000000000000x0000x0000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACP_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810070">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AD1DF1IF" edc:desc="" edc:mask="0x1" edc:name="AD1DF1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1DF2IF" edc:desc="" edc:mask="0x1" edc:name="AD1DF2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1DF3IF" edc:desc="" edc:mask="0x1" edc:name="AD1DF3IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1DF4IF" edc:desc="" edc:mask="0x1" edc:name="AD1DF4IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1FIIF" edc:desc="" edc:mask="0x1" edc:name="AD1FIIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1EOSIF" edc:desc="" edc:mask="0x1" edc:name="AD1EOSIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1ARIF" edc:desc="" edc:mask="0x1" edc:name="AD1ARIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1RSIF" edc:mask="0x1" edc:name="AD1RSIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AD1FCBTIF" edc:desc="" edc:mask="0x1" edc:name="AD1FCBTIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1GIF" edc:desc="" edc:mask="0x1" edc:name="AD1GIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D0IF" edc:desc="" edc:mask="0x1" edc:name="AD1D0IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D1IF" edc:desc="" edc:mask="0x1" edc:name="AD1D1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D2IF" edc:desc="" edc:mask="0x1" edc:name="AD1D2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D3IF" edc:desc="" edc:mask="0x1" edc:name="AD1D3IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D4IF" edc:desc="" edc:mask="0x1" edc:name="AD1D4IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D5IF" edc:desc="" edc:mask="0x1" edc:name="AD1D5IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D6IF" edc:desc="" edc:mask="0x1" edc:name="AD1D6IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D7IF" edc:desc="" edc:mask="0x1" edc:name="AD1D7IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D8IF" edc:desc="" edc:mask="0x1" edc:name="AD1D8IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D9IF" edc:desc="" edc:mask="0x1" edc:name="AD1D9IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D10IF" edc:desc="" edc:mask="0x1" edc:name="AD1D10IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D11IF" edc:desc="" edc:mask="0x1" edc:name="AD1D11IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D12IF" edc:desc="" edc:mask="0x1" edc:name="AD1D12IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D13IF" edc:desc="" edc:mask="0x1" edc:name="AD1D13IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D14IF" edc:desc="" edc:mask="0x1" edc:name="AD1D14IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D15IF" edc:desc="" edc:mask="0x1" edc:name="AD1D15IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D16IF" edc:desc="" edc:mask="0x1" edc:name="AD1D16IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D17IF" edc:desc="" edc:mask="0x1" edc:name="AD1D17IF" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="n--n----------------------------" edc:cname="IFS4" edc:desc="" edc:impl="0x90000000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0--0----------------------------" edc:name="IFS4" edc:nzwidth="32" edc:por="0--0----------------------------" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACP_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810080">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="28"/>
            <edc:SFRFieldDef edc:cname="AD1D50IF" edc:desc="" edc:mask="0x1" edc:name="AD1D50IF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="AD1D53IF" edc:desc="" edc:mask="0x1" edc:name="AD1D53IF" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="------nnnn-----nnnnnnnn--------n" edc:cname="IFS5" edc:desc="" edc:impl="0x3c1fe01" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------0000-----uuuuuuuu--------0" edc:name="IFS5" edc:nzwidth="32" edc:por="------0000-----xxxxxxxx--------0" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACP_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810090">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CMP3IF" edc:desc="" edc:mask="0x1" edc:name="CMP3IF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="QEI1IF" edc:mask="0x1" edc:name="QEI1IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QEI2IF" edc:mask="0x1" edc:name="QEI2IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWMPEVTIF" edc:mask="0x1" edc:name="PWMPEVTIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWMSEVTIF" edc:mask="0x1" edc:name="PWMSEVTIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWM1IF" edc:mask="0x1" edc:name="PWM1IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWM2IF" edc:mask="0x1" edc:name="PWM2IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWM3IF" edc:mask="0x1" edc:name="PWM3IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWM4IF" edc:mask="0x1" edc:name="PWM4IF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="DMA4IF" edc:desc="" edc:mask="0x1" edc:name="DMA4IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA5IF" edc:desc="" edc:mask="0x1" edc:name="DMA5IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA6IF" edc:desc="" edc:mask="0x1" edc:name="DMA6IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA7IF" edc:desc="" edc:mask="0x1" edc:name="DMA7IF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x10" edc:_modsrc="DOS-02907_WACP_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F8100A0"/>
      <edc:SFRDef edc:access="nn----n-n----------------n------" edc:cname="IFS7" edc:desc="" edc:impl="0xc2800040" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uu----u-u----------------u------" edc:name="IFS7" edc:nzwidth="32" edc:por="xx----x-x----------------x------" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACP_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F8100B0">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="SBIF" edc:mask="0x1" edc:name="SBIF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="10"/>
            <edc:SFRFieldDef edc:cname="PCACHEIF" edc:desc="PCACHE Interrupt Flag" edc:mask="0x1" edc:name="PCACHEIF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CLC1IF" edc:mask="0x1" edc:name="CLC1IF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="CPCIF" edc:mask="0x1" edc:name="CPCIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CPDIF" edc:mask="0x1" edc:name="CPDIF" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xfffe3fff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
