Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0128MCA048.PIC
      <edc:SFRDef edc:access="nn-----nnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IEC0" edc:desc="" edc:impl="0xc1ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-----0000000000000000000000000" edc:name="IEC0" edc:nzwidth="32" edc:por="00-----0000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACP_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F8100C0">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CTIE" edc:desc="" edc:mask="0x1" edc:name="CTIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CS0IE" edc:desc="" edc:mask="0x1" edc:name="CS0IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CS1IE" edc:desc="" edc:mask="0x1" edc:name="CS1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT0IE" edc:desc="" edc:mask="0x1" edc:name="INT0IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T1IE" edc:desc="" edc:mask="0x1" edc:name="T1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC1EIE" edc:desc="" edc:mask="0x1" edc:name="IC1EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC1IE" edc:desc="" edc:mask="0x1" edc:name="IC1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC1IE" edc:desc="" edc:mask="0x1" edc:name="OC1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT1IE" edc:desc="" edc:mask="0x1" edc:name="INT1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T2IE" edc:desc="" edc:mask="0x1" edc:name="T2IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC2EIE" edc:desc="" edc:mask="0x1" edc:name="IC2EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC2IE" edc:desc="" edc:mask="0x1" edc:name="IC2IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC2IE" edc:desc="" edc:mask="0x1" edc:name="OC2IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT2IE" edc:desc="" edc:mask="0x1" edc:name="INT2IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T3IE" edc:desc="" edc:mask="0x1" edc:name="T3IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC3EIE" edc:desc="" edc:mask="0x1" edc:name="IC3EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC3IE" edc:desc="" edc:mask="0x1" edc:name="IC3IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC3IE" edc:desc="" edc:mask="0x1" edc:name="OC3IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT3IE" edc:desc="" edc:mask="0x1" edc:name="INT3IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T4IE" edc:desc="" edc:mask="0x1" edc:name="T4IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC4EIE" edc:desc="" edc:mask="0x1" edc:name="IC4EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC4IE" edc:desc="" edc:mask="0x1" edc:name="IC4IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC4IE" edc:desc="" edc:mask="0x1" edc:name="OC4IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT4IE" edc:desc="" edc:mask="0x1" edc:name="INT4IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T5IE" edc:desc="" edc:mask="0x1" edc:name="T5IE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="RTCCIE" edc:desc="" edc:mask="0x1" edc:name="RTCCIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FCEIE" edc:desc="" edc:mask="0x1" edc:name="FCEIE" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--nnnnnnnnn-----nnnnnnnnnnnnn-nn" edc:cname="IEC1" edc:desc="" edc:impl="0x3fe0dffb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000000-----0000000000000-00" edc:name="IEC1" edc:nzwidth="32" edc:por="--000000000-----0000000000000-00" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACP_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F8100D0">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CMP1IE" edc:desc="" edc:mask="0x1" edc:name="CMP1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CMP2IE" edc:desc="" edc:mask="0x1" edc:name="CMP2IE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SPI1EIE" edc:desc="" edc:mask="0x1" edc:name="SPI1EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI1RXIE" edc:desc="" edc:mask="0x1" edc:name="SPI1RXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI1TXIE" edc:desc="" edc:mask="0x1" edc:name="SPI1TXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U1EIE" edc:desc="" edc:mask="0x1" edc:name="U1EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U1RXIE" edc:desc="" edc:mask="0x1" edc:name="U1RXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U1TXIE" edc:desc="" edc:mask="0x1" edc:name="U1TXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C1BIE" edc:desc="" edc:mask="0x1" edc:name="I2C1BIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C1SIE" edc:desc="" edc:mask="0x1" edc:name="I2C1SIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C1MIE" edc:desc="" edc:mask="0x1" edc:name="I2C1MIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNAIE" edc:desc="" edc:mask="0x1" edc:name="CNAIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNBIE" edc:desc="" edc:mask="0x1" edc:name="CNBIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNCIE" edc:desc="" edc:mask="0x1" edc:name="CNCIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNDIE" edc:desc="" edc:mask="0x1" edc:name="CNDIE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="SPI2EIE" edc:desc="" edc:mask="0x1" edc:name="SPI2EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI2RXIE" edc:desc="" edc:mask="0x1" edc:name="SPI2RXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI2TXIE" edc:desc="" edc:mask="0x1" edc:name="SPI2TXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U2EIE" edc:desc="" edc:mask="0x1" edc:name="U2EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U2RXIE" edc:desc="" edc:mask="0x1" edc:name="U2RXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U2TXIE" edc:desc="" edc:mask="0x1" edc:name="U2TXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C2BIE" edc:desc="" edc:mask="0x1" edc:name="I2C2BIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C2SIE" edc:desc="" edc:mask="0x1" edc:name="I2C2SIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C2MIE" edc:desc="" edc:mask="0x1" edc:name="I2C2MIE" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nn-n----------------nnnnn-------" edc:cname="IEC2" edc:desc="" edc:impl="0xd0000f80" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-0----------------00000-------" edc:name="IEC2" edc:nzwidth="32" edc:por="0x-0----------------00000-------" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACP_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F8100E0">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="7"/>
            <edc:SFRFieldDef edc:cname="CTMUIE" edc:desc="" edc:mask="0x1" edc:name="CTMUIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA0IE" edc:desc="" edc:mask="0x1" edc:name="DMA0IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA1IE" edc:desc="" edc:mask="0x1" edc:name="DMA1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA2IE" edc:desc="" edc:mask="0x1" edc:name="DMA2IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA3IE" edc:desc="" edc:mask="0x1" edc:name="DMA3IE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="16"/>
            <edc:SFRFieldDef edc:cname="AD1IE" edc:desc="" edc:mask="0x1" edc:name="AD1IE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="AD1DC1IE" edc:mask="0x1" edc:name="AD1DC1IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AD1DC2IE" edc:desc="" edc:mask="0x1" edc:name="AD1DC2IE" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----nnnnnnnnnnnnnnnnnnnnnnnn--nn" edc:cname="IEC3" edc:desc="" edc:impl="0xffffff3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----000000000000000000000000--00" edc:name="IEC3" edc:nzwidth="32" edc:por="----000000000000000x0000x000--00" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACP_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F8100F0">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AD1DF1IE" edc:desc="" edc:mask="0x1" edc:name="AD1DF1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1DF2IE" edc:desc="" edc:mask="0x1" edc:name="AD1DF2IE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="AD1FIIE" edc:desc="" edc:mask="0x1" edc:name="AD1FIIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1EOSIE" edc:desc="" edc:mask="0x1" edc:name="AD1EOSIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1ARIE" edc:desc="" edc:mask="0x1" edc:name="AD1ARIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1RSIE" edc:mask="0x1" edc:name="AD1RSIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AD1FCBTIE" edc:desc="" edc:mask="0x1" edc:name="AD1FCBTIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1GIE" edc:desc="" edc:mask="0x1" edc:name="AD1GIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D0IE" edc:desc="" edc:mask="0x1" edc:name="AD1D0IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D1IE" edc:desc="" edc:mask="0x1" edc:name="AD1D1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D2IE" edc:desc="" edc:mask="0x1" edc:name="AD1D2IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D3IE" edc:desc="" edc:mask="0x1" edc:name="AD1D3IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D4IE" edc:desc="" edc:mask="0x1" edc:name="AD1D4IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D5IE" edc:desc="" edc:mask="0x1" edc:name="AD1D5IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D6IE" edc:desc="" edc:mask="0x1" edc:name="AD1D6IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D7IE" edc:desc="" edc:mask="0x1" edc:name="AD1D7IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D8IE" edc:desc="" edc:mask="0x1" edc:name="AD1D8IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D9IE" edc:desc="" edc:mask="0x1" edc:name="AD1D9IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D10IE" edc:desc="" edc:mask="0x1" edc:name="AD1D10IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D11IE" edc:desc="" edc:mask="0x1" edc:name="AD1D11IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D12IE" edc:desc="" edc:mask="0x1" edc:name="AD1D12IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D13IE" edc:desc="" edc:mask="0x1" edc:name="AD1D13IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D14IE" edc:desc="" edc:mask="0x1" edc:name="AD1D14IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D15IE" edc:desc="" edc:mask="0x1" edc:name="AD1D15IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D16IE" edc:desc="" edc:mask="0x1" edc:name="AD1D16IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D17IE" edc:desc="" edc:mask="0x1" edc:name="AD1D17IE" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="n--n----------------------------" edc:cname="IEC4" edc:desc="" edc:impl="0x90000000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0--0----------------------------" edc:name="IEC4" edc:nzwidth="32" edc:por="0--0----------------------------" edc:portals="CLR SET INV" ltx:memberofperipheral="INT" edc:_modsrc="DOS-02907_WACP_int_evic_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x940" edc:_addr="0x1F810100">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="28"/>
            <edc:SFRFieldDef edc:cname="AD1D50IE" edc:desc="" edc:mask="0x1" edc:name="AD1D50IE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="AD1D53IE" edc:desc="" edc:mask="0x1" edc:name="AD1D53IE" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
