Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0128MCA048.PIC
      <edc:SFRDef edc:access="----------------n--nnnnnnn---nnn" edc:cname="LATC" edc:desc="" edc:grp="PORTC" edc:impl="0xffff9fc7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------x--xxxxxxx---xxx" edc:name="LATC" edc:nzwidth="0x20" edc:por="----------------x--xxxxxxx---xxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860230">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LATC0" edc:desc="" edc:mask="0x1" edc:name="LATC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATC1" edc:desc="" edc:mask="0x1" edc:name="LATC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATC2" edc:desc="" edc:mask="0x1" edc:name="LATC2" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LATC6" edc:desc="" edc:mask="0x1" edc:name="LATC6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATC7" edc:desc="" edc:mask="0x1" edc:name="LATC7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATC8" edc:desc="" edc:mask="0x1" edc:name="LATC8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATC9" edc:desc="" edc:mask="0x1" edc:name="LATC9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATC10" edc:desc="" edc:mask="0x1" edc:name="LATC10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATC11" edc:desc="" edc:mask="0x1" edc:name="LATC11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATC12" edc:desc="" edc:mask="0x1" edc:name="LATC12" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LATC15" edc:desc="" edc:mask="0x1" edc:name="LATC15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------n--nnnnnnn---nnn" edc:cname="ODCC" edc:desc="" edc:grp="PORTC" edc:impl="0xffff9fc7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0--0000000---000" edc:name="ODCC" edc:nzwidth="0x20" edc:por="----------------0--0000000---000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860240">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ODCC0" edc:desc="" edc:mask="0x1" edc:name="ODCC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCC1" edc:desc="" edc:mask="0x1" edc:name="ODCC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCC2" edc:desc="" edc:mask="0x1" edc:name="ODCC2" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCC6" edc:desc="" edc:mask="0x1" edc:name="ODCC6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCC7" edc:desc="" edc:mask="0x1" edc:name="ODCC7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCC8" edc:desc="" edc:mask="0x1" edc:name="ODCC8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCC9" edc:desc="" edc:mask="0x1" edc:name="ODCC9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCC10" edc:desc="" edc:mask="0x1" edc:name="ODCC10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCC11" edc:desc="" edc:mask="0x1" edc:name="ODCC11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCC12" edc:desc="" edc:mask="0x1" edc:name="ODCC12" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCC15" edc:desc="" edc:mask="0x1" edc:name="ODCC15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------n--nnnnnnn---nnn" edc:cname="CNPUC" edc:desc="" edc:grp="PORTC" edc:impl="0xffff9fc7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0--0000000---000" edc:name="CNPUC" edc:nzwidth="0x20" edc:por="----------------0--0000000---000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860250">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPUC0" edc:desc="" edc:mask="0x1" edc:name="CNPUC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC1" edc:desc="" edc:mask="0x1" edc:name="CNPUC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC2" edc:desc="" edc:mask="0x1" edc:name="CNPUC2" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPUC6" edc:desc="" edc:mask="0x1" edc:name="CNPUC6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC7" edc:desc="" edc:mask="0x1" edc:name="CNPUC7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC8" edc:desc="" edc:mask="0x1" edc:name="CNPUC8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC9" edc:desc="" edc:mask="0x1" edc:name="CNPUC9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC10" edc:desc="" edc:mask="0x1" edc:name="CNPUC10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC11" edc:desc="" edc:mask="0x1" edc:name="CNPUC11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC12" edc:desc="" edc:mask="0x1" edc:name="CNPUC12" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPUC15" edc:desc="" edc:mask="0x1" edc:name="CNPUC15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------n--nnnnnnn---nnn" edc:cname="CNPDC" edc:desc="" edc:grp="PORTC" edc:impl="0xffff9fc7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0--0000000---000" edc:name="CNPDC" edc:nzwidth="0x20" edc:por="----------------0--0000000---000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860260">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPDC0" edc:desc="" edc:mask="0x1" edc:name="CNPDC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC1" edc:desc="" edc:mask="0x1" edc:name="CNPDC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC2" edc:desc="" edc:mask="0x1" edc:name="CNPDC2" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPDC6" edc:desc="" edc:mask="0x1" edc:name="CNPDC6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC7" edc:desc="" edc:mask="0x1" edc:name="CNPDC7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC8" edc:desc="" edc:mask="0x1" edc:name="CNPDC8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC9" edc:desc="" edc:mask="0x1" edc:name="CNPDC9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC10" edc:desc="" edc:mask="0x1" edc:name="CNPDC10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC11" edc:desc="" edc:mask="0x1" edc:name="CNPDC11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC12" edc:desc="" edc:mask="0x1" edc:name="CNPDC12" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPDC15" edc:desc="" edc:mask="0x1" edc:name="CNPDC15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------n---n-----------" edc:cname="CNCONC" edc:desc="" edc:grp="PORTC" edc:impl="0xffff9fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0---0-----------" edc:name="CNCONC" edc:nzwidth="0x20" edc:por="----------------0---0-----------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860270">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0xb"/>
            <edc:SFRFieldDef edc:cname="EDGEDETECT" edc:mask="0x1" edc:name="EDGEDETECT" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CHANGE NOTICE C" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------n--nnnnnnn---nnn" edc:cname="CNENC" edc:desc="" edc:grp="PORTC" edc:impl="0xffc09fc7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0--0000000---000" edc:name="CNENC" edc:nzwidth="0x20" edc:por="----------------0--0000000---000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860280">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNIEC0" edc:desc="" edc:mask="0x1" edc:name="CNIEC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC1" edc:desc="" edc:mask="0x1" edc:name="CNIEC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC2" edc:desc="" edc:mask="0x1" edc:name="CNIEC2" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNIEC6" edc:desc="" edc:mask="0x1" edc:name="CNIEC6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC7" edc:desc="" edc:mask="0x1" edc:name="CNIEC7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC8" edc:desc="" edc:mask="0x1" edc:name="CNIEC8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC9" edc:desc="" edc:mask="0x1" edc:name="CNIEC9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC10" edc:desc="" edc:mask="0x1" edc:name="CNIEC10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC11" edc:desc="" edc:mask="0x1" edc:name="CNIEC11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC12" edc:desc="" edc:mask="0x1" edc:name="CNIEC12" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNIEC15" edc:desc="" edc:mask="0x1" edc:name="CNIEC15" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------n--nnnnnnn---nnn" edc:cname="CNSTATC" edc:desc="" edc:grp="PORTC" edc:impl="0xffff9fc7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0--0000000---000" edc:name="CNSTATC" edc:nzwidth="0x20" edc:por="----------------0--0000000---000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F860290">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNSTATC0" edc:desc="" edc:mask="0x1" edc:name="CNSTATC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC1" edc:desc="" edc:mask="0x1" edc:name="CNSTATC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC2" edc:desc="" edc:mask="0x1" edc:name="CNSTATC2" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC6" edc:desc="" edc:mask="0x1" edc:name="CNSTATC6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC7" edc:desc="" edc:mask="0x1" edc:name="CNSTATC7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC8" edc:desc="" edc:mask="0x1" edc:name="CNSTATC8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC9" edc:desc="" edc:mask="0x1" edc:name="CNSTATC9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC10" edc:desc="" edc:mask="0x1" edc:name="CNSTATC10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC11" edc:desc="" edc:mask="0x1" edc:name="CNSTATC11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC12" edc:desc="" edc:mask="0x1" edc:name="CNSTATC12" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC15" edc:desc="" edc:mask="0x1" edc:name="CNSTATC15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------n--nnnnnnn---nnn" edc:cname="CNNEC" edc:desc="" edc:impl="0x9fc7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0--0000000---000" edc:name="CNNEC" edc:nzwidth="32" edc:por="----------------0--0000000---000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F8602A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNNEC0" edc:mask="0x1" edc:name="CNNEC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEC1" edc:mask="0x1" edc:name="CNNEC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEC2" edc:mask="0x1" edc:name="CNNEC2" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNNEC6" edc:mask="0x1" edc:name="CNNEC6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEC7" edc:mask="0x1" edc:name="CNNEC7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEC8" edc:mask="0x1" edc:name="CNNEC8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEC9" edc:mask="0x1" edc:name="CNNEC9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEC10" edc:mask="0x1" edc:name="CNNEC10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEC11" edc:mask="0x1" edc:name="CNNEC11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEC12" edc:mask="0x1" edc:name="CNNEC12" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNNEC15" edc:mask="0x1" edc:name="CNNEC15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------------n--nnnnnnn---nnn" edc:cname="CNFC" edc:desc="" edc:impl="0x9fc7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0--0000000---000" edc:name="CNFC" edc:nzwidth="32" edc:por="----------------0--0000000---000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xe0" edc:_addr="0x1F8602B0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNFC0" edc:mask="0x1" edc:name="CNFC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC1" edc:mask="0x1" edc:name="CNFC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC2" edc:mask="0x1" edc:name="CNFC2" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNFC6" edc:mask="0x1" edc:name="CNFC6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC7" edc:mask="0x1" edc:name="CNFC7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC8" edc:mask="0x1" edc:name="CNFC8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC9" edc:mask="0x1" edc:name="CNFC9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC10" edc:mask="0x1" edc:name="CNFC10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC11" edc:mask="0x1" edc:name="CNFC11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC12" edc:mask="0x1" edc:name="CNFC12" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNFC15" edc:mask="0x1" edc:name="CNFC15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
