Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0128MCA048.PIC
      <edc:SFRDef edc:access="----------n--n------------------" edc:cname="ADCCSS2" edc:desc="" edc:impl="0x240000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------0--0------------------" edc:name="ADCCSS2" edc:nzwidth="32" edc:por="----------0--0------------------" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS" edc:_modsrc="DOS-02508_WACP_adc_sar_ctrl_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe20" edc:_addr="0x1F8870B0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="18"/>
            <edc:SFRFieldDef edc:cname="CSS50" edc:mask="0x1" edc:name="CSS50" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="CSS53" edc:mask="0x1" edc:name="CSS53" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------rrrrrrrrrrrrrrrrrr" edc:cname="ADCDSTAT1" edc:desc="" edc:impl="0x3ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------000000000000000000" edc:name="ADCDSTAT1" edc:nzwidth="32" edc:por="--------------000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS" edc:_modsrc="DOS-02508_WACP_adc_sar_ctrl_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe20" edc:_addr="0x1F8870C0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ARDY0" edc:mask="0x1" edc:name="ARDY0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY1" edc:mask="0x1" edc:name="ARDY1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY2" edc:mask="0x1" edc:name="ARDY2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY3" edc:mask="0x1" edc:name="ARDY3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY4" edc:mask="0x1" edc:name="ARDY4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY5" edc:mask="0x1" edc:name="ARDY5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY6" edc:mask="0x1" edc:name="ARDY6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY7" edc:mask="0x1" edc:name="ARDY7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY8" edc:mask="0x1" edc:name="ARDY8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY9" edc:mask="0x1" edc:name="ARDY9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY10" edc:mask="0x1" edc:name="ARDY10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY11" edc:mask="0x1" edc:name="ARDY11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY12" edc:mask="0x1" edc:name="ARDY12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY13" edc:mask="0x1" edc:name="ARDY13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY14" edc:mask="0x1" edc:name="ARDY14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY15" edc:mask="0x1" edc:name="ARDY15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY16" edc:mask="0x1" edc:name="ARDY16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY17" edc:mask="0x1" edc:name="ARDY17" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------r--r------------------" edc:cname="ADCDSTAT2" edc:desc="" edc:impl="0x240000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------0--0------------------" edc:name="ADCDSTAT2" edc:nzwidth="32" edc:por="----------0--0------------------" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS" edc:_modsrc="DOS-02508_WACP_adc_sar_ctrl_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe20" edc:_addr="0x1F8870D0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="18"/>
            <edc:SFRFieldDef edc:cname="ARDY50" edc:mask="0x1" edc:name="ARDY50" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="ARDY53" edc:mask="0x1" edc:name="ARDY53" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------nnnnnnnnnnnnnnnnnn" edc:cname="ADCCMPEN1" edc:desc="" edc:impl="0x3ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------000000000000000000" edc:name="ADCCMPEN1" edc:nzwidth="32" edc:por="--------------000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS" edc:_modsrc="DOS-02508_WACP_adc_sar_ctrl_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe20" edc:_addr="0x1F8870E0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CMPE0" edc:mask="0x1" edc:name="CMPE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE1" edc:mask="0x1" edc:name="CMPE1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE2" edc:mask="0x1" edc:name="CMPE2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE3" edc:mask="0x1" edc:name="CMPE3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE4" edc:mask="0x1" edc:name="CMPE4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE5" edc:mask="0x1" edc:name="CMPE5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE6" edc:mask="0x1" edc:name="CMPE6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE7" edc:mask="0x1" edc:name="CMPE7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE8" edc:mask="0x1" edc:name="CMPE8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE9" edc:mask="0x1" edc:name="CMPE9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE10" edc:mask="0x1" edc:name="CMPE10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE11" edc:mask="0x1" edc:name="CMPE11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE12" edc:mask="0x1" edc:name="CMPE12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE13" edc:mask="0x1" edc:name="CMPE13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE14" edc:mask="0x1" edc:name="CMPE14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE15" edc:mask="0x1" edc:name="CMPE15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE16" edc:mask="0x1" edc:name="CMPE16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE17" edc:mask="0x1" edc:name="CMPE17" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCCMP1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADCCMP1" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS" edc:_modsrc="DOS-02508_WACP_adc_sar_ctrl_upb_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xe20" edc:_addr="0x1F8870F0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DCMPLO" edc:mask="0xffff" edc:name="DCMPLO" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="DCMPHI" edc:mask="0xffff" edc:name="DCMPHI" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
