Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/edc/PIC32MK0128MCA048.PIC
      <edc:AdjustPoint edc:offset="4" edc:_addr="0x1F8F842C"/>
      <edc:SFRDef edc:access="-------------------------------r" edc:cname="SBT1ECLRS" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------------------0" edc:name="SBT1ECLRS" edc:nzwidth="32" edc:por="-------------------------------0" ltx:memberofperipheral="SB" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="12" edc:_begin="0x10" edc:_end="0x14" edc:_addr="0x1F8F8430">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CLEAR" edc:desc="" edc:mask="0x1" edc:name="CLEAR" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="4" edc:_addr="0x1F8F8434"/>
      <edc:SFRDef edc:access="-------------------------------r" edc:cname="SBT1ECLRM" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------------------0" edc:name="SBT1ECLRM" edc:nzwidth="32" edc:por="-------------------------------0" ltx:memberofperipheral="SB" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="13" edc:_begin="0x14" edc:_end="0x18" edc:_addr="0x1F8F8438">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CLEAR" edc:desc="" edc:mask="0x1" edc:name="CLEAR" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="4" edc:_addr="0x1F8F843C"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnr-nnnnn---" edc:cname="SBT1REG0" edc:desc="" edc:impl="0xfffffef8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000000000x-00000---" edc:name="SBT1REG0" edc:nzwidth="32" edc:por="0000000000000000000000x-00000---" ltx:memberofperipheral="SB" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="14" edc:_begin="0x18" edc:_end="0x1c" edc:_addr="0x1F8F8440">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SIZE" edc:desc="" edc:mask="0x1f" edc:name="SIZE" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="PRI" edc:desc="" edc:mask="0x1" edc:name="PRI" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BASE" edc:desc="" edc:mask="0x3fffff" edc:name="BASE" edc:nzwidth="22"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="12" edc:_addr="0x1F8F8444"/>
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="SBT1RD0" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------1111" edc:name="SBT1RD0" edc:nzwidth="32" edc:por="----------------------------1111" ltx:memberofperipheral="SB" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="15" edc:_begin="0x1c" edc:_end="0x20" edc:_addr="0x1F8F8450">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="GROUP0" edc:desc="" edc:mask="0x1" edc:name="GROUP0" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP1" edc:desc="" edc:mask="0x1" edc:name="GROUP1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP2" edc:desc="" edc:mask="0x1" edc:name="GROUP2" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP3" edc:desc="" edc:mask="0x1" edc:name="GROUP3" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="4" edc:_addr="0x1F8F8454"/>
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="SBT1WR0" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------1111" edc:name="SBT1WR0" edc:nzwidth="32" edc:por="----------------------------1111" ltx:memberofperipheral="SB" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="16" edc:_begin="0x20" edc:_end="0x24" edc:_addr="0x1F8F8458">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="GROUP0" edc:desc="" edc:mask="0x1" edc:name="GROUP0" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP1" edc:desc="" edc:mask="0x1" edc:name="GROUP1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP2" edc:desc="" edc:mask="0x1" edc:name="GROUP2" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP3" edc:desc="" edc:mask="0x1" edc:name="GROUP3" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="36" edc:_addr="0x1F8F845C"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnr-nnnnn---" edc:cname="SBT1REG2" edc:desc="" edc:impl="0xfffffef8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000000000x-00000---" edc:name="SBT1REG2" edc:nzwidth="32" edc:por="0000000000000000000000x-00000---" ltx:memberofperipheral="SB" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="17" edc:_begin="0x18" edc:_end="0x1c" edc:_addr="0x1F8F8480">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SIZE" edc:desc="" edc:mask="0x1f" edc:name="SIZE" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="PRI" edc:desc="" edc:mask="0x1" edc:name="PRI" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BASE" edc:desc="" edc:mask="0x3fffff" edc:name="BASE" edc:nzwidth="22"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="12" edc:_addr="0x1F8F8484"/>
      <edc:SFRDef edc:access="----------------------------nnnn" edc:cname="SBT1RD2" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------1111" edc:name="SBT1RD2" edc:nzwidth="32" edc:por="----------------------------1111" ltx:memberofperipheral="SB" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="18" edc:_begin="0x1c" edc:_end="0x20" edc:_addr="0x1F8F8490">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="GROUP0" edc:desc="" edc:mask="0x1" edc:name="GROUP0" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP1" edc:desc="" edc:mask="0x1" edc:name="GROUP1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP2" edc:desc="" edc:mask="0x1" edc:name="GROUP2" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP3" edc:desc="" edc:mask="0x1" edc:name="GROUP3" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
